In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
animals = DataFrame(np.arange(16).reshape(4,4),columns = ['W','X','Y','Z'],index = ['Dog','Cat','Bird','Mouse'])

In [4]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [5]:
eval("print(5)")

5

In [6]:
animals.W

Dog       0
Cat       4
Bird      8
Mouse    12
Name: W, dtype: int32

In [7]:
animals.W['Dog']= int(0)
animals.W['Cat']=np.nan
animals.Y['Cat']=np.nan

<ipython-input-7-ea219427bd3d>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  animals.Y['Cat']=np.nan
C:\Users\HP\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [8]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [9]:
behavior_map = {'W':'good','X':'bad','Y':'good','Z':'bad'}

In [10]:
behavior_map

{'W': 'good', 'X': 'bad', 'Y': 'good', 'Z': 'bad'}

In [11]:
# groups the dataset by good and bad by their column names
animals.groupby(behavior_map,axis=1).sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [12]:
t = Series(behavior_map)

In [13]:
t

W    good
X     bad
Y    good
Z     bad
dtype: object

In [14]:
animals.groupby(t,axis=1).sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [19]:
animals.groupby(len,axis=1).sum()

#It group the datasets by len of the row name for example the length of dog and cat are 2 which is same so it group by this and computes the sum

          1
Dog     6.0
Cat    12.0
Bird   38.0
Mouse  54.0

In [16]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [17]:
m = ['A','B','A','B']

In [18]:
animals.groupby([len,m]).sum()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   0.0   5   0.0   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [20]:
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]],names=['city','sub_value'])

In [21]:
hier_col

MultiIndex([('NY', 1),
            ('NY', 2),
            ('NY', 3),
            ('SF', 1),
            ('SF', 2)],
           names=['city', 'sub_value'])

In [23]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns=hier_col)

In [28]:
print(dframe_hr.index.name)

None

In [29]:
dframe_hr

city       NY          SF
sub_value   1   2   3   1   2
0           0   1   2   3   4
1           5   6   7   8   9
2          10  11  12  13  14
3          15  16  17  18  19
4          20  21  22  23  24

In [30]:
dframe_hr *= 100

In [31]:
dframe_hr

city         NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400

In [33]:
dframe_hr.groupby('city',axis=1).sum()

city    NY    SF
0      300   700
1     1800  1700
2     3300  2700
3     4800  3700
4     6300  4700

In [39]:
dframe_hr.groupby(['sub_value'],axis=1).sum()

sub_value     1     2     3
0           300   500   200
1          1300  1500   700
2          2300  2500  1200
3          3300  3500  1700
4          4300  4500  2200